# Назовем число счастливым если это число превращается в 1 после нескольких итераций вида:
# число заменяется на число, равное сумме квадратов его цифр;
# Напишите программу, которая определяет является ли введенное число счастливым или нет.

n = int(input())

while n >= 10:
    n = sum([i ** 2 for i in list(map(int, list(str(n))))])
    if n < 10:
        break

if n == 1:
    print('YES')
else:
    print('NO')