# На вход программе подается натуральное число n. 
# В последовательности чисел от 1 до n, начиная слева направо, удалите первое число, 
# а затем все остальные числа через одно, пока не дойдете до конца списка. 
# Повторите этот процесс еще раз, но на этот раз справа налево, 
# удалите крайнее правое число и все остальные числа через одно из оставшихся чисел. 
# Продолжайте этот процесс, чередуя слева направо и справа налево, пока не останется одно число.
# Напишите программу, которая выводит последнее оставшееся число.

def left_to_right(lst):
    for i in range(0, len(lst), 2):
        lst[i] = 0
    lst_l = [i for i in lst if i != 0]
    return lst_l

def right_to_left(lst):
    lst = lst[::-1]
    for i in range(0, len(lst), 2):
        lst[i] = 0
    lst = [i for i in lst if i != 0]
    return lst[::-1]

lst = [i for i in range(1, int(input()) + 1)]
while len(lst) > 1:
    lst = left_to_right(lst)
    if len(lst) > 1:
        lst = right_to_left(lst)
print(*lst)