# Напишите программу, которая определяет, содержит ли пятизначное число две одинаковые цифры, стоящие рядом.

num = input()

for i in range(len(num) - 1):
    if num[i] == num[i + 1]: # проверяем одинаковые ли соседние цифры
        print('YES')
        break # делаем break потому что нужно найти хотя-бы одно совпадение
else:
    print('NO') # если вышли из цикла => нет одинаковых цифр