# Назовем тройку чисел хорошей, если среди них есть хотя бы одно четное и хотя бы одно нечетное число.
# Напишите программу, которая определяет является ли тройка чисел хорошей или нет.

even = 0  # счетчики для четных и нечетных чисел
odd = 0

for _ in range(3):
    num = int(input())  # сразу записываем к четным или нечетным числам
    if num % 2 == 0:
        even += 1
    else:
        odd += 1

if even and odd:  # только если есть оба вида чисел
    print('YES')
else:
    print('NO')