# Продолжительность каждого урока в онлайн-школе BEEGEEK 45 минут, а перемены между уроками – 5 минут. Первый урок начинается ровно в 8 часов утра. 
# Напишите программу, определяющую во сколько заканчивается n-ый урок?

num_of_lesson = int(input())

hour = 8 + (num_of_lesson * 45 + 5 * (num_of_lesson - 1)) // 60  # считаем количество часов, используем n - 1 для перемен потому что урок заканчивается и перемены не будет
minutes = (num_of_lesson * 45 + 5 * (num_of_lesson - 1)) % 60  # считаем количество минут по той же формуле

print(hour, minutes)