# Тимур подключен к интернету по следующему тарифному плану: ежемесячная абонентская плата составляет a рублей, и в эту абонентскую плату включено b мегабайт трафика. 
# Неизрасходованные мегабайты в конце месяца «сгорают». 
# Если трафик превышает b мегабайт, то каждый мегабайт трафика сверх предоплаченных стоит c рублей.
# Известно, что за прошлый месяц Тимур израсходовал d мегабайт трафика. 
# Напишите программу, которая определяет во сколько обошелся ему доступ в интернет в прошлом месяце (считайте в том числе и абонентскую плату)?

cost_of_tariff = int(input())
amount_of_mb = int(input())
cost_above_mb = int(input())
spend_mb = int(input())

if amount_of_mb - spend_mb >= 0:  # смотрим, есть ли мб сверх плана
    additional_cost = 0
else:
    additional_cost = (spend_mb - amount_of_mb) * cost_above_mb  # если есть то считаем за каждый мб cost_above_mb рублей 

all_cost = cost_of_tariff + additional_cost  # находим общую стоимость
print(all_cost)