# На вход программе подаются натуральные числа n, m и k. 
# Напишите программу, которая будет определять, можно ли от шоколадки размером n×m долек отломить k долек, 
# если разрешается сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).

n, m, k = int(input()), int(input()), int(input())

if ((k % n == 0  and (k // n) <= m) or (k % m == 0 and (k // m) <= n)) and k <= n * m:  # проверяем можем ли мы отломить какие-то строчки или столбцы
    print('YES')
else:
    print('NO')