# Рассмотрим последовательность чисел в которой каждое натуральное число k встречается ровно k раз: 1,2,2,3,3,3,4,4,4,4,...
# Напишите программу, которая по данному натуральному числу k выведет первые k членов этой последовательности.

n = int(input())
lst = []
k = 1
while len(lst) < n:
    for _ in range(k):
        lst.append(k)
        if len(lst) == n:
            break
    k += 1
print(*lst)