# Напишите программу, которая выводит n-ую цифру бесконечной 
# последовательности чисел: 12345678910111213141516171819202122...

n = int(input())

x = 0
b = 1

while x < n:
     b += 1
     x += len(str(b))

print(str(b)[(n % len(str(b))) - 1 -(x % (len(str(b))))])